In [1]:
import pandas as pd

In [2]:
x = {
    'name':['A','B','C'],
    'age':[34,45,67],
    'sal':(34000,67000,89000)
}

In [3]:
x

{'name': ['A', 'B', 'C'], 'age': [34, 45, 67], 'sal': (34000, 67000, 89000)}

In [4]:
df = pd.DataFrame(x)

In [5]:
df

  name  age    sal
0    A   34  34000
1    B   45  67000
2    C   67  89000

In [7]:
df['name'][0]

'A'

In [9]:
df.to_excel('myfirstfile.xlsx')

In [10]:
df

  name  age    sal
0    A   34  34000
1    B   45  67000
2    C   67  89000

In [14]:
pd.read_excel('myfirstfile.xlsx')

   Unnamed: 0 name  age    sal
0           0    X   34  34000
1           1    Y   45  78000
2           2    Z   67  89000

In [ ]:
# how to import any file(xl,csv)
# df = pd.read_csv('path/data_name/data_extension')

In [21]:
df = pd.read_csv('C:/Users/Satyam/Downloads/Iris.csv')

In [22]:
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica